Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionBase.Attributes Property
 Gets or sets the curved dimension set base attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public CurvedDimensionSetBase.CurvedDimensionSetBaseAttributes Attributes { get; set; }
Public Property Attributes As CurvedDimensionSetBase.CurvedDimensionSetBaseAttributes
	Get
	Set
Property Value
Type: CurvedDimensionSetBase.CurvedDimensionSetBaseAttributes
See Also
Reference
CurvedDimensionBase Class
Tekla.Structures.Drawing Namespace